ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/device/StdDriver/nuc472_sd.c
/**************************************************************************//**
 * @file     SD.c
 * @version  V1.00
 * $Revision: 16 $
 * $Date: 15/11/26 10:45a $
 * @brief    NUC472/NUC442 SD driver source file
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "NUC472_442.h"

/** @addtogroup NUC472_442_Device_Driver NUC472/NUC442 Device Driver
  @{
*/

/** @addtogroup NUC472_442_SD_Driver SD Driver
  @{
*/


/** @addtogroup NUC472_442_SD_EXPORTED_FUNCTIONS SD Exported Functions
  @{
*/
#define SD_BLOCK_SIZE   512

/// @cond HIDDEN_SYMBOLS

// global variables
// For response R3 (such as ACMD41, CRC-7 is invalid; but SD controller will still
// calculate CRC-7 and get an error result, software should ignore this error and clear SDISR [CRC_IF] flag
// _sd_uR3_CMD is the flag for it. 1 means software should ignore CRC-7 error
uint32_t _sd_uR3_CMD = 0;
uint32_t _sd_uR7_CMD = 0;
uint8_t volatile _sd_SDDataReady = FALSE;

uint8_t *_sd_pSDHCBuffer;
uint32_t _sd_ReferenceClock;

#if defined (__CC_ARM)
__align(4096) uint8_t _sd_ucSDHCBuffer[512];
#elif defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma data_alignment = 4096
uint8_t _sd_ucSDHCBuffer[512];
#elif defined ( __GNUC__ )
uint8_t _sd_ucSDHCBuffer[512] __attribute__((aligned(4096)));
#endif

int sd0_ok = 0;
int sd1_ok = 0;

uint8_t pSD0_offset = 0;
uint8_t pSD1_offset = 0;

DISK_DATA_T SD_DiskInfo0;
DISK_DATA_T SD_DiskInfo1;

SD_INFO_T SD0;
SD_INFO_T SD1;

void SD_CheckRB()
{
    while (1) {
        SD->CTL |= SDH_CTL_CLK8OEN_Msk;
        while (SD->CTL & SDH_CTL_CLK8OEN_Msk);
        if (SD->INTSTS & SDH_INTSTS_DAT0STS_Msk) {
            break;
        }
    }
}


int SD_SDCommand(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg)
{
    volatile int buf;

    SD->CMDARG = uArg;
    buf = (SD->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8) | (SDH_CTL_COEN_Msk);
    SD->CTL = buf;

    while (SD->CTL & SDH_CTL_COEN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SD_NO_SD_CARD;
        }
    }
    return Successful;
}


int SD_SDCmdAndRsp(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg, int ntickCount)
{
    volatile int buf;

    SD->CMDARG = uArg;
    buf = (SD->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8) | (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk);
    SD->CTL = buf;

    if (ntickCount > 0) {
        while (SD->CTL & SDH_CTL_RIEN_Msk) {
            if (ntickCount-- == 0) {
                SD->CTL |= SDH_CTL_CTLRST_Msk; // reset SD engine
                return 2;
            }
            if (pSD->IsCardInsert == FALSE) {
                return SD_NO_SD_CARD;
            }
        }
    } else {
        while (SD->CTL & SDH_CTL_RIEN_Msk) {
            if (pSD->IsCardInsert == FALSE) {
                return SD_NO_SD_CARD;
            }
        }
    }

    if (_sd_uR7_CMD) {
        if (((SD->RESP1 & 0xff) != 0x55) && ((SD->RESP0 & 0xf) != 0x01)) {
            _sd_uR7_CMD = 0;
            return SD_CMD8_ERROR;
        }
    }

    if (!_sd_uR3_CMD) {
        if (SD->INTSTS & SDH_INTSTS_CRC7_Msk) {   // check CRC7
            return Successful;
        } else {
            return SD_CRC7_ERROR;
        }
    } else { // ignore CRC error for R3 case
        _sd_uR3_CMD = 0;
        SD->INTSTS = SDH_INTSTS_CRCIF_Msk;
        return Successful;
    }
}


int SD_Swap32(int val)
{
#if 1
    int buf;

    buf = val;
    val <<= 24;
    val |= (buf << 8) & 0xff0000;
    val |= (buf >> 8) & 0xff00;
    val |= (buf >> 24) & 0xff;
    return val;

#else
    return ((val << 24) | ((val << 8) & 0xff0000) | ((val >> 8) & 0xff00) | (val >> 24));
#endif
}

// Get 16 bytes CID or CSD
int SD_SDCmdAndRsp2(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg, uint32_t *puR2ptr)
{
    unsigned int i, buf;
    unsigned int tmpBuf[5];

    SD->CMDARG = uArg;
    buf = (SD->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8) | (SDH_CTL_COEN_Msk | SDH_CTL_R2EN_Msk);
    SD->CTL = buf;

    while (SD->CTL & SDH_CTL_R2EN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SD_NO_SD_CARD;
        }
    }

    if (SD->INTSTS & SDH_INTSTS_CRC7_Msk) {
        for (i = 0; i < 5; i++) {
            tmpBuf[i] = SD_Swap32(*(int *)(SD_BASE + i * 4));
        }
        for (i = 0; i < 4; i++) {
            *puR2ptr++ = ((tmpBuf[i] & 0x00ffffff) << 8) | ((tmpBuf[i + 1] & 0xff000000) >> 24);
        }
        return Successful;
    } else {
        return SD_CRC7_ERROR;
    }
}


int SD_SDCmdAndRspDataIn(SD_INFO_T *pSD, uint8_t ucCmd, uint32_t uArg)
{
    volatile int buf;

    SD->CMDARG = uArg;
    buf = (SD->CTL & (~SDH_CTL_CMDCODE_Msk)) | (ucCmd << 8) |
          (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);

    SD->CTL = buf;

    while (SD->CTL & SDH_CTL_RIEN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SD_NO_SD_CARD;
        }
    }

    while (SD->CTL & SDH_CTL_DIEN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SD_NO_SD_CARD;
        }
    }

    if (!(SD->INTSTS & SDH_INTSTS_CRC7_Msk)) {    // check CRC7
        return SD_CRC7_ERROR;
    }

    if (!(SD->INTSTS & SDH_INTSTS_CRC16_Msk)) {   // check CRC16
        return SD_CRC16_ERROR;
    }
    return Successful;
}

// there are 8 bits for divider0, maximum is 256
#define SD_CLK_DIV0_MAX     256

void SD_Set_clock(uint32_t sd_clock_khz)
{
    uint32_t rate, div1, i;
    uint32_t u32SD_ClkSrc;

    if (sd_clock_khz >= 24000) {
        sd_clock_khz = 24000;
    }

    u32SD_ClkSrc = (CLK->CLKSEL0 & CLK_CLKSEL0_SDHSEL_Msk);

    if (u32SD_ClkSrc == CLK_CLKSEL0_SDHSEL_HXT) {
        _sd_ReferenceClock = (CLK_GetHXTFreq() / 1000);
    } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDHSEL_HIRC) {
        _sd_ReferenceClock = (__HIRC / 1000);
    } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDHSEL_PLL) {
        _sd_ReferenceClock = (CLK_GetPLLClockFreq() / 1000);
    } else if (u32SD_ClkSrc == CLK_CLKSEL0_SDHSEL_HCLK) {
        _sd_ReferenceClock = (CLK_GetHCLKFreq() / 1000);
    }

