ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/device/StdDriver/nuc472_sd.c
    rate = _sd_ReferenceClock / sd_clock_khz;

    // choose slower clock if system clock cannot divisible by wanted clock
    if (_sd_ReferenceClock % sd_clock_khz != 0) {
        rate++;
    }

    if (rate >= SD_CLK_DIV0_MAX) {
        rate = SD_CLK_DIV0_MAX;
    }

    //--- calculate the second divider CLKDIV0[SDHOST_N]
    div1 = ((rate - 1) & 0xFF);

    //--- setup register
    CLK->CLKDIV0 &= ~CLK_CLKDIV0_SDHDIV_Msk;
    CLK->CLKDIV0 |= (div1 << CLK_CLKDIV0_SDHDIV_Pos);

    for (i = 0; i < 1000; i++); // waiting for clock become stable
    return;
}

void SD_CardSelect(int cardSel)
{
    if (cardSel == 0) {
        SD->CTL |= (SD->CTL & ~SDH_CTL_SDPORT_Msk);
    } else if (cardSel == 1) {
        SD->CTL |= ((SD->CTL & ~SDH_CTL_SDPORT_Msk) | (1 << SDH_CTL_SDPORT_Pos));
    }
}

uint32_t SD_CardDetection(uint32_t u32CardNum)
{
    uint32_t i;

    if (u32CardNum == SD_PORT0) {
        if (SD->INTEN & SDH_INTEN_CDSRC0_Msk) { // Card detect pin from GPIO
            if (SD->INTSTS & SDH_INTSTS_CDSTS0_Msk) { // Card remove
                SD0.IsCardInsert = FALSE;
                return FALSE;
            } else {
                SD0.IsCardInsert = TRUE;
            }
        } else if (!(SD->INTEN & SDH_INTEN_CDSRC0_Msk)) {
            SD->CTL |= SDH_CTL_CLKKEEP0_Msk;
            for (i = 0; i < 5000; i++);

            if (SD->INTSTS & SDH_INTSTS_CDSTS0_Msk) { // Card insert
                SD0.IsCardInsert = TRUE;
            } else {
                SD0.IsCardInsert = FALSE;
                return FALSE;
            }

            SD->CTL &= ~SDH_CTL_CLKKEEP0_Msk;
        }

    } else if (u32CardNum == SD_PORT1) {
        if (SD->INTEN & SDH_INTEN_CDSRC1_Msk) { // Card detect pin from GPIO
            if (SD->INTSTS & SDH_INTSTS_CDSTS1_Msk) { // Card remove
                SD1.IsCardInsert = FALSE;
                return FALSE;
            } else {
                SD1.IsCardInsert = TRUE;
            }
        } else if (!(SD->INTEN & SDH_INTEN_CDSRC1_Msk)) {
            SD->CTL |= SDH_CTL_CLKKEEP1_Msk;
            for (i = 0; i < 5000; i++);

            if (SD->INTSTS & SDH_INTSTS_CDSTS1_Msk) { // Card insert
                SD1.IsCardInsert = TRUE;
            } else {
                SD1.IsCardInsert = FALSE;
                return FALSE;
            }

            SD->CTL &= ~SDH_CTL_CLKKEEP1_Msk;
        }

    }

    return TRUE;
}


// Initial
int SD_Init(SD_INFO_T *pSD)
{
    int volatile i, status;
    unsigned int resp;
    unsigned int CIDBuffer[4];
    unsigned int volatile u32CmdTimeOut;

    // set the clock to 200KHz
    //SD_Set_clock(200);
    SD_Set_clock(100);

    // power ON 74 clock
    SD->CTL |= SDH_CTL_CLK74OEN_Msk;

    while (SD->CTL & SDH_CTL_CLK74OEN_Msk) {
        if (pSD->IsCardInsert == FALSE) {
            return SD_NO_SD_CARD;
        }
    }

    SD_SDCommand(pSD, 0, 0);        // reset all cards
    for (i = 0x1000; i > 0; i--);

    // initial SDHC
    _sd_uR7_CMD = 1;
    //u32CmdTimeOut = 5000;
    u32CmdTimeOut = 0xFFFFF;
    //u32CmdTimeOut = 0;

    i = SD_SDCmdAndRsp(pSD, 8, 0x00000155, u32CmdTimeOut);
    if (i == Successful) {
        // SD 2.0
        SD_SDCmdAndRsp(pSD, 55, 0x00, u32CmdTimeOut);
        _sd_uR3_CMD = 1;
        SD_SDCmdAndRsp(pSD, 41, 0x40ff8000, u32CmdTimeOut); // 2.7v-3.6v
        resp = SD->RESP0;

        while (!(resp & 0x00800000)) {      // check if card is ready
            SD_SDCmdAndRsp(pSD, 55, 0x00, u32CmdTimeOut);
            _sd_uR3_CMD = 1;
            SD_SDCmdAndRsp(pSD, 41, 0x40ff8000, u32CmdTimeOut); // 3.0v-3.4v
            resp = SD->RESP0;
        }
        if (resp & 0x00400000) {
            pSD->CardType = SD_TYPE_SD_HIGH;
        } else {
            pSD->CardType = SD_TYPE_SD_LOW;
        }
    } else {
        // SD 1.1
        SD_SDCommand(pSD, 0, 0);        // reset all cards
        for (i = 0x100; i > 0; i--);

        i = SD_SDCmdAndRsp(pSD, 55, 0x00, u32CmdTimeOut);
        if (i == 2) {   // MMC memory

            SD_SDCommand(pSD, 0, 0);        // reset
            for (i = 0x100; i > 0; i--);

            _sd_uR3_CMD = 1;

            if (SD_SDCmdAndRsp(pSD, 1, 0x40ff8000, u32CmdTimeOut) != 2) {  // eMMC memory
                resp = SD->RESP0;
                while (!(resp & 0x00800000)) {      // check if card is ready
                    _sd_uR3_CMD = 1;

                    SD_SDCmdAndRsp(pSD, 1, 0x40ff8000, u32CmdTimeOut);      // high voltage
                    resp = SD->RESP0;
                }

                if (resp & 0x00400000) {
                    pSD->CardType = SD_TYPE_EMMC;
                } else {
                    pSD->CardType = SD_TYPE_MMC;
                }
            } else {
                pSD->CardType = SD_TYPE_UNKNOWN;
                return SD_ERR_DEVICE;
            }
        } else if (i == 0) { // SD Memory
            _sd_uR3_CMD = 1;
            SD_SDCmdAndRsp(pSD, 41, 0x00ff8000, u32CmdTimeOut); // 3.0v-3.4v
            resp = SD->RESP0;
            while (!(resp & 0x00800000)) {      // check if card is ready
                SD_SDCmdAndRsp(pSD, 55, 0x00, u32CmdTimeOut);
                _sd_uR3_CMD = 1;
                SD_SDCmdAndRsp(pSD, 41, 0x00ff8000, u32CmdTimeOut); // 3.0v-3.4v
                resp = SD->RESP0;
            }
            pSD->CardType = SD_TYPE_SD_LOW;
        } else {
            pSD->CardType = SD_TYPE_UNKNOWN;
            return SD_INIT_ERROR;
        }
    }

    // CMD2, CMD3
    if (pSD->CardType != SD_TYPE_UNKNOWN) {
        SD_SDCmdAndRsp2(pSD, 2, 0x00, CIDBuffer);
        if ((pSD->CardType == SD_TYPE_MMC) || (pSD->CardType == SD_TYPE_EMMC)) {
            if ((status = SD_SDCmdAndRsp(pSD, 3, 0x10000, 0)) != Successful) {      // set RCA
                return status;
            }
            pSD->RCA = 0x10000;
        } else {
            if ((status = SD_SDCmdAndRsp(pSD, 3, 0x00, 0)) != Successful) {     // get RCA
                return status;
            } else {
                pSD->RCA = (SD->RESP0 << 8) & 0xffff0000;
            }
        }
    }

    return Successful;
}


int SD_SwitchToHighSpeed(SD_INFO_T *pSD)
{
    int volatile status = 0;
    uint16_t current_comsumption, busy_status0;

