ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/device/StdDriver/nuc472_sd.c
    SD->DMASA = (uint32_t)_sd_pSDHCBuffer;    // set DMA transfer starting address
    SD->BLEN = 63;    // 512 bit

    if ((status = SD_SDCmdAndRspDataIn(pSD, 6, 0x00ffff01)) != Successful) {
        return Fail;
    }

    current_comsumption = _sd_pSDHCBuffer[0] << 8 | _sd_pSDHCBuffer[1];
    if (!current_comsumption) {
        return Fail;
    }

    busy_status0 = _sd_pSDHCBuffer[28] << 8 | _sd_pSDHCBuffer[29];

    if (!busy_status0) { // function ready
        SD->DMASA = (uint32_t)_sd_pSDHCBuffer;        // set DMA transfer starting address
        SD->BLEN = 63;    // 512 bit

        if ((status = SD_SDCmdAndRspDataIn(pSD, 6, 0x80ffff01)) != Successful) {
            return Fail;
        }

        // function change timing: 8 clocks
        SD->CTL |= SDH_CTL_CLK8OEN_Msk;
        while (SD->CTL & SDH_CTL_CLK8OEN_Msk);

        current_comsumption = _sd_pSDHCBuffer[0] << 8 | _sd_pSDHCBuffer[1];
        if (!current_comsumption) {
            return Fail;
        }

        return Successful;
    } else {
        return Fail;
    }
}


int SD_SelectCardType(SD_INFO_T *pSD)
{
    int volatile status = 0;
    unsigned int arg;

    if ((status = SD_SDCmdAndRsp(pSD, 7, pSD->RCA, 0)) != Successful) {
        return status;
    }

    SD_CheckRB();

    // if SD card set 4bit
    if (pSD->CardType == SD_TYPE_SD_HIGH) {
        _sd_pSDHCBuffer = (uint8_t *)((uint32_t)_sd_ucSDHCBuffer);
        SD->DMASA = (uint32_t)_sd_pSDHCBuffer;    // set DMA transfer starting address
        SD->BLEN = 0x07;  // 64 bit

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful) {
            return status;
        }
        if ((status = SD_SDCmdAndRspDataIn(pSD, 51, 0x00)) != Successful) {
            return status;
        }

        if ((_sd_ucSDHCBuffer[0] & 0xf) == 0x2) {
            status = SD_SwitchToHighSpeed(pSD);
            if (status == Successful) {
                /* divider */
                SD_Set_clock(SDHC_FREQ);
            }
        }

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful) {
            return status;
        }
        if ((status = SD_SDCmdAndRsp(pSD, 6, 0x02, 0)) != Successful) { // set bus width
            return status;
        }

        SD->CTL |= SDH_CTL_DBW_Msk;
    } else if (pSD->CardType == SD_TYPE_SD_LOW) {
        _sd_pSDHCBuffer = (uint8_t *)((uint32_t)_sd_ucSDHCBuffer);
        SD->DMASA = (uint32_t) _sd_pSDHCBuffer; // set DMA transfer starting address
        SD->BLEN = 0x07;  // 64 bit

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful) {
            return status;
        }
        if ((status = SD_SDCmdAndRspDataIn(pSD, 51, 0x00)) != Successful) {
            return status;
        }

        // set data bus width. ACMD6 for SD card, SDCR_DBW for host.
        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->RCA, 0)) != Successful) {
            return status;
        }

        if ((status = SD_SDCmdAndRsp(pSD, 6, 0x02, 0)) != Successful) { // set bus width
            return status;
        }

        SD->CTL |= SDH_CTL_DBW_Msk;
    } else if ((pSD->CardType == SD_TYPE_MMC) || (pSD->CardType == SD_TYPE_EMMC)) {

        if (pSD->CardType == SD_TYPE_MMC) {
            SD->CTL &= ~SDH_CTL_DBW_Msk;
        }

        //--- sent CMD6 to MMC card to set bus width to 4 bits mode
        // set CMD6 argument Access field to 3, Index to 183, Value to 1 (4-bit mode)
        arg = (3 << 24) | (183 << 16) | (1 << 8);
        if ((status = SD_SDCmdAndRsp(pSD, 6, arg, 0)) != Successful) {
            return status;
        }
        SD_CheckRB();

        SD->CTL |= SDH_CTL_DBW_Msk;; // set bus width to 4-bit mode for SD host controller

    }

    if ((status = SD_SDCmdAndRsp(pSD, 16, SD_BLOCK_SIZE, 0)) != Successful) { // set block length
        return status;
    }
    SD->BLEN = SD_BLOCK_SIZE - 1;           // set the block size

    SD_SDCommand(pSD, 7, 0);
    SD->CTL |= SDH_CTL_CLK8OEN_Msk;
    while (SD->CTL & SDH_CTL_CLK8OEN_Msk);

#ifdef _SD_USE_INT_
    SD->INTEN |= SDH_INTEN_BLKDIEN_Msk;
#endif  //_SD_USE_INT_

    return Successful;
}

void SD_Get_SD_info(SD_INFO_T *pSD, DISK_DATA_T *_info)
{
    unsigned int R_LEN, C_Size, MULT, size;
    unsigned int Buffer[4];
    unsigned char *ptr;

    SD_SDCmdAndRsp2(pSD, 9, pSD->RCA, Buffer);

    if ((pSD->CardType == SD_TYPE_MMC) || (pSD->CardType == SD_TYPE_EMMC)) {
        // for MMC/eMMC card
        if ((Buffer[0] & 0xc0000000) == 0xc0000000) {
            // CSD_STRUCTURE [127:126] is 3
            // CSD version depend on EXT_CSD register in eMMC v4.4 for card size > 2GB
            SD_SDCmdAndRsp(pSD, 7, pSD->RCA, 0);

            ptr = (uint8_t *)((uint32_t)_sd_ucSDHCBuffer);
            SD->DMASA = (uint32_t)ptr;  // set DMA transfer starting address
            SD->BLEN = 511;  // read 512 bytes for EXT_CSD

            if (SD_SDCmdAndRspDataIn(pSD, 8, 0x00) != Successful) {
                return;
            }

            SD_SDCommand(pSD, 7, 0);
            SD->CTL |= SDH_CTL_CLK8OEN_Msk;
            while (SD->CTL & SDH_CTL_CLK8OEN_Msk);

            _info->totalSectorN = (*(uint32_t *)(ptr + 212));
            _info->diskSize = _info->totalSectorN / 2;
        } else {
            // CSD version v1.0/1.1/1.2 in eMMC v4.4 spec for card size <= 2GB
            R_LEN = (Buffer[1] & 0x000f0000) >> 16;
            C_Size = ((Buffer[1] & 0x000003ff) << 2) | ((Buffer[2] & 0xc0000000) >> 30);
            MULT = (Buffer[2] & 0x00038000) >> 15;
            size = (C_Size + 1) * (1 << (MULT + 2)) * (1 << R_LEN);

            _info->diskSize = size / 1024;
            _info->totalSectorN = size / 512;
        }
    } else {
        if (Buffer[0] & 0xc0000000) {
            C_Size = ((Buffer[1] & 0x0000003f) << 16) | ((Buffer[2] & 0xffff0000) >> 16);
            size = (C_Size + 1) * 512;  // Kbytes

            _info->diskSize = size;
            _info->totalSectorN = size << 1;
        } else {
            R_LEN = (Buffer[1] & 0x000f0000) >> 16;
            C_Size = ((Buffer[1] & 0x000003ff) << 2) | ((Buffer[2] & 0xc0000000) >> 30);
            MULT = (Buffer[2] & 0x00038000) >> 15;
            size = (C_Size + 1) * (1 << (MULT + 2)) * (1 << R_LEN);

            _info->diskSize = size / 1024;
            _info->totalSectorN = size / 512;
        }
    }

    _info->sectorSize = 512;
}

int SD_ChipErase(SD_INFO_T *pSD, DISK_DATA_T *_info)
{
    int status = 0;

    status = SD_SDCmdAndRsp(pSD, 32, 512, 6000);
    if (status < 0) {
        return status;
    }
    status = SD_SDCmdAndRsp(pSD, 33, _info->totalSectorN * 512, 6000);
    if (status < 0) {
        return status;
    }
    status = SD_SDCmdAndRsp(pSD, 38, 0, 6000);
    if (status < 0) {
        return status;
    }
    SD_CheckRB();

