ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/device/StdDriver/nuc472_sd.c
    return 0;
}

/// @endcond HIDDEN_SYMBOLS


/**
 *  @brief  This function use to reset SD function and select card detection source and pin.
 *
 *  @param[in]  u32CardDetSrc   Select card detection source from SD0 or SD1. ( \ref SD_PORT0 / \ref SD_PORT1) \n
 *                          And also select card detection pin from GPIO or DAT3 pin. ( \ref CardDetect_From_GPIO / \ref CardDetect_From_DAT3)
 *
 *  @return None
 */
void SD_Open(uint32_t u32CardDetSrc)
{
    // Enable SD Card Host Controller operation.
    //CLK->AHBCLK |= CLK_AHBCLK_SDHCKEN_Msk;

    // enable DMAC
    SD->DMACTL = SDH_DMACTL_DMARST_Msk;
    while (SD->DMACTL & SDH_DMACTL_DMARST_Msk);

    SD->DMACTL = SDH_DMACTL_DMAEN_Msk;

    //Reset FMI
    SD->GCTL = SDH_GCTL_GCTLRST_Msk;        // Start reset FMI controller.
    while (SD->GCTL & SDH_GCTL_GCTLRST_Msk);


//#ifdef _SD_USE_INT_
//    NVIC_EnableIRQ(SD_IRQn);
//#endif  //_SD_USE_INT_

    // enable SD
    SD->GCTL = SDH_GCTL_SDEN_Msk;

    if (u32CardDetSrc & SD_PORT0) {
        SD->CTL |= (SD->CTL & ~SDH_CTL_SDPORT_Msk);

        if (u32CardDetSrc & CardDetect_From_DAT3) {
            SD->INTEN &= ~SDH_INTEN_CDSRC0_Msk;
        } else {
            SD->INTEN |= SDH_INTEN_CDSRC0_Msk;
        }
    } else if (u32CardDetSrc & SD_PORT1) {
        SD->CTL |= ((SD->CTL & ~SDH_CTL_SDPORT_Msk) | (1 << SDH_CTL_SDPORT_Pos));

        if (u32CardDetSrc & CardDetect_From_DAT3) {
            SD->INTEN &= ~SDH_INTEN_CDSRC1_Msk;
        } else {
            SD->INTEN |= SDH_INTEN_CDSRC1_Msk;
        }
    }

    SD->CTL |= SDH_CTL_CTLRST_Msk;     // SD software reset
    while (SD->CTL & SDH_CTL_CTLRST_Msk);

    SD->CTL &= ~((0xFF) | (SDH_CTL_CLKKEEP1_Msk));    // disable SD clock output

    if (u32CardDetSrc & SD_PORT0) {
        memset(&SD0, 0, sizeof(SD_INFO_T));
    } else if (u32CardDetSrc & SD_PORT1) {
        memset(&SD1, 0, sizeof(SD_INFO_T));
    }

}

/**
 *  @brief  This function use to initial SD card.
 *
 *  @param[in]  u32CardNum  Select initial SD0 or SD1. ( \ref SD_PORT0 / \ref SD_PORT1)
 *
 *  @return None
 */
void SD_Probe(uint32_t u32CardNum)
{
    // Disable FMI/SD host interrupt
    SD->GINTEN = 0;

    SD->CTL &= ~SDH_CTL_SDNWR_Msk;
    SD->CTL |=  0x09 << SDH_CTL_SDNWR_Pos;         // set SDNWR = 9
    SD->CTL &= ~SDH_CTL_BLKCNT_Msk;
    SD->CTL |=  0x01 << SDH_CTL_BLKCNT_Pos;           // set BLKCNT = 1
    SD->CTL &= ~SDH_CTL_DBW_Msk;               // SD 1-bit data bus

    if (!(SD_CardDetection(u32CardNum))) {
        return;
    }

    if (u32CardNum == SD_PORT0) {
        if (SD_Init(&SD0) < 0) {
            return;
        }

        /* divider */
        if (SD0.CardType == SD_TYPE_MMC) {
            SD_Set_clock(20000);
        } else {
            SD_Set_clock(SD_FREQ);
        }

        SD_Get_SD_info(&SD0, &SD_DiskInfo0);

        if (SD_SelectCardType(&SD0)) {
            return;
        }

        sd0_ok = 1;
    } else if (u32CardNum == SD_PORT1) {
        if (SD_Init(&SD1) < 0) {
            return;
        }

        /* divider */
        if (SD1.CardType == SD_TYPE_MMC) {
            SD_Set_clock(20000);
        } else {
            SD_Set_clock(SD_FREQ);
        }

        SD_Get_SD_info(&SD1, &SD_DiskInfo1);

        if (SD_SelectCardType(&SD1)) {
            return;
        }

        sd1_ok = 1;
    }


}

/**
 *  @brief  This function use to read data from SD card.
 *
 *  @param[in]     u32CardNum    Select card: SD0 or SD1. ( \ref SD_PORT0 / \ref SD_PORT1)
 *  @param[out]    pu8BufAddr    The buffer to receive the data from SD card.
 *  @param[in]     u32StartSec   The start read sector address.
 *  @param[in]     u32SecCount   The the read sector number of data
 *
 *  @return None
 */
uint32_t SD_Read(uint32_t u32CardNum, uint8_t *pu8BufAddr, uint32_t u32StartSec, uint32_t u32SecCount)
{
    char volatile bIsSendCmd = FALSE, buf;
    unsigned int volatile reg;
    int volatile i, loop, status;
    uint32_t blksize = SD_BLOCK_SIZE;

    SD_INFO_T *pSD;

    if (u32CardNum == SD_PORT0) {
        pSD = &SD0;
    } else {
        pSD = &SD1;
    }

    //--- check input parameters
    if (u32SecCount == 0) {
        return SD_SELECT_ERROR;
    }

    if ((status = SD_SDCmdAndRsp(pSD, 7, pSD->RCA, 0)) != Successful) {
        return status;
    }
    SD_CheckRB();

    SD->BLEN = blksize - 1;       // the actual byte count is equal to (SDBLEN+1)

    if ((pSD->CardType == SD_TYPE_SD_HIGH) || (pSD->CardType == SD_TYPE_EMMC)) {
        SD->CMDARG = u32StartSec;
    } else {
        SD->CMDARG = u32StartSec * blksize;
    }

    SD->DMASA = (uint32_t)pu8BufAddr;

    loop = u32SecCount / 255;
    for (i = 0; i < loop; i++) {
#ifdef _SD_USE_INT_
        _sd_SDDataReady = FALSE;
#endif  //_SD_USE_INT_

        reg = SD->CTL & ~SDH_CTL_CMDCODE_Msk;
        reg = reg | 0xff0000;   // set BLK_CNT to 255
        if (bIsSendCmd == FALSE) {
            SD->CTL = reg | (18 << 8) | (SDH_CTL_COEN_Msk | SDH_CTL_RIEN_Msk | SDH_CTL_DIEN_Msk);
            bIsSendCmd = TRUE;
        } else {
            SD->CTL = reg | SDH_CTL_DIEN_Msk;
        }

#ifdef _SD_USE_INT_
        while (!_sd_SDDataReady)
#else
        while (1)
#endif  //_SD_USE_INT_
        {
            if (_sd_SDDataReady) {
                break;
            }

#ifndef _SD_USE_INT_
            if ((SD->INTSTS & SDH_INTSTS_BLKDIF_Msk) && (!(SD->CTL & SDH_CTL_DIEN_Msk))) {
                SD->INTSTS = SDH_INTSTS_BLKDIF_Msk;
                break;
            }
#endif
            if (pSD->IsCardInsert == FALSE) {
                return SD_NO_SD_CARD;
            }
        }

        if (!(SD->INTSTS & SDH_INTSTS_CRC7_Msk)) {    // check CRC7
            //printf("sdioSD_Read_in_blksize(): response error!\n");
            return SD_CRC7_ERROR;
        }

        if (!(SD->INTSTS & SDH_INTSTS_CRC16_Msk)) {   // check CRC16
            //printf("sdioSD_Read_in_blksize() :read data error!\n");
            return SD_CRC16_ERROR;
        }
    }

    loop = u32SecCount % 255;
    if (loop != 0) {
#ifdef _SD_USE_INT_
        _sd_SDDataReady = FALSE;
#endif  //_SD_USE_INT_

        reg = SD->CTL & (~SDH_CTL_CMDCODE_Msk);
        reg = reg & (~SDH_CTL_BLKCNT_Msk);
        reg |= (loop << 16);    // setup SDCR_BLKCNT

